blog/soundscapes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-12-18 Fri 11:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Soundscapes On The Emacspeak Audio Desktop</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Soundscapes On The Emacspeak Audio Desktop</h1>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Executive Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacspeak module <a href="http://tvraman.github.io/emacspeak/manual/soundscape.html">soundscape</a> adds the ability to automatically switch
<b>Soundscapes</b> based on the current buffer. A <b>Soundscape</b> can be any
continuously playing stream of audio; in practice, using nature sounds
that repeat softly in a pseudo-random manner appears to be
effective. Soundscapes are activated based on the currently active
<i>Emacs Major Mode</i> and as a consequence directly mirror the user's
current activity. The present implementation uses Python package
<a href="http://boodler.org/">Boodler</a> to generate soundscapes.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Usage</h2>
<div class="outline-text-2" id="text-2">
<p>
Note that package <code>soundscape.el</code> does not have any Emacspeak
dependencies. See the <a href="http://tvraman.github.io/emacspeak/manual/soundscape">package documentation</a> for details on installing
and configuring <a href="http://boodler.org/">Boodler</a>. 
</p>

<p>
You can experiment with installed Boodler agents using command
<code>soundscape</code> and <code>soundscape-stop</code>. You can enable and disable
<i>automatic soundscapes</i> using command <code>soundscape-toggle</code>. The
currently active default Soundscape theme can be inspected via command
<code>soundscape-display</code> &#x2014; this produces a buffer that lists the
currently defined /major-mode -&gt; Soundscape mapping. 
</p>

<p>
Package <code>soundscape.el</code> considers the inheritance relationship among
Emacs major-modes when computing the set of <i>soundscapes</i> to
activate.As an example, <span class="underline">eww-mode</span> inherits from <span class="underline">special-mode</span> &#x2014; as
a consequence, two soundscapes (<i>LightWind</i> and <i>BackgroundWaves</i>)
become active when reading Web content.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Default Major-Mode-&gt;Soundscape (Mood) Mapping:</h2>
<div class="outline-text-2" id="text-3">
<p>
Here is a table showing the mapping of major-mmodes to Soundscape
moods at the time of writing. For readability, I have stripped out the
<span class="underline">package-name</span> for these soundscapes.
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Soundscape (Mood)</td>
<td class="org-left">List Of Major Modes</td>
</tr>

<tr>
<td class="org-left">BuddhaLoop</td>
<td class="org-left">fundamental</td>
</tr>

<tr>
<td class="org-left">LightStorm</td>
<td class="org-left">special</td>
</tr>

<tr>
<td class="org-left">RainForever</td>
<td class="org-left">Info help Man Custom messages-buffer</td>
</tr>

<tr>
<td class="org-left">LightWind</td>
<td class="org-left">comint elfeed-search</td>
</tr>

<tr>
<td class="org-left">TonkSpace</td>
<td class="org-left">tabulated-list</td>
</tr>

<tr>
<td class="org-left">Cavern</td>
<td class="org-left">prog</td>
</tr>

<tr>
<td class="org-left">Drip</td>
<td class="org-left">message gnus-summary gnus-article gnus-group mspools vm-presentation vm mail twittering jabber-roster jabber-chat erc</td>
</tr>

<tr>
<td class="org-left">Still</td>
<td class="org-left">text</td>
</tr>

<tr>
<td class="org-left">Water</td>
<td class="org-left">dired</td>
</tr>

<tr>
<td class="org-left">Steady</td>
<td class="org-left">calendar diary</td>
</tr>

<tr>
<td class="org-left">BackgroundWaves</td>
<td class="org-left">w3 eww</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Soundscape Research</h2>
<div class="outline-text-2" id="text-4">
<p>
I implemented package <code>soundscape.el</code> to create a platform that would
let me experiment with different tools that aid in
concentration. After using Soundscapes for about a week, I have also
found that it reduces some of the fatigue that results from having to
listen to synthetic text-to-speech for extended  periods.
The true value (if any) of this package will be a function of how heavily
I find myself using it six months from now &#x2014; as a metric, <i>complete
success</i>  might mean that in mid-2016, I still  have automatic
soundscapes turned on.
As I type this article in Emacs <span class="underline">org-mode</span>, I hear  the sound of
water-drops falling softly in the background, and I take note
that I have not switched tasks  for the entire time I have spent
writing this article.
</p>

<p>
Other success metrics &#x2014; harder to measure &#x2014; might include how
effective Soundscapes are in helping the user stay focused on a
given activity for extended periods of time. In an ever-connected
world buzzing with a constant stream of distractions ranging from
incoming email and instant-messages to a flood of twitter updates,
this is likely the most relevant metric.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-12-18 Fri&gt;</span></span></p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2015-12-18 Fri 11:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
